cylinder_re300/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "5000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
68056
(
(1.000004 -9.2566593e-06 0)
(1.0000363 -2.6753043e-05 0)
(1.0001047 -4.3798837e-05 0)
(1.0002087 -6.0748856e-05 0)
(1.0003463 -7.7660021e-05 0)
(1.0005175 -9.4584823e-05 0)
(1.0007226 -0.00011157018 0)
(1.0009619 -0.00012863148 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
    cylinder
    {
        type            noSlip;
    }
}


// ************************************************************************* //
