cylinder_re300/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
68056
(
0.00014735648
0.00014489329
0.00014279794
0.00014098375
0.0001393901
0.00013797325
0.00013670081
0.00013554819
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.00015;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.00010169549
0.00010170343
0.000101717
0.00010174459
0.00010179563
0.00010188173
0.00010201863
0.00010222862
...
)
;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
    cylinder
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
912
(
5.9105838e-09
3.00668e-09
2.574559e-08
1.7376617e-10
1.9847575e-08
3.5548573e-09
1.7180421e-09
1.5207786e-09
...
)
;
    }
}


// ************************************************************************* //
